/* 
1. Дані два масиви: ['a', 'b', 'c'] та [1, 2, 3]. Об'єднайте їх разом.
*/

let arr1 = ["a", "b", "c"];
let arr2 = [1, 2, 3];

let arr3 = arr1.concat(arr2);

document.write(`<h3> 1. ${arr3} </h3>`);

/*
2. Дан масив ['a', 'b', 'c']. Додайте йому до кінця елементи 1, 2, 3.
 */

arr1 = ["a", "b", "c"];

// arr1.splice(3, 0, 1, 2, 3);
// document.write(arr1);

arr1.push(1, 2, 3);
document.write(`<h3> 2. ${arr1} </h3>`);

/*
3. Дан масив [1, 2, 3]. Зробіть із нього масив [3, 2, 1].</li>
 */

arr1 = [1, 2, 3];
arr1.reverse();
document.write(`<h3> 3. ${arr1} </h3>`);

/*
4. Дан масив [1, 2, 3]. Додайте йому до кінця елементи 4, 5, 6.</li>
 */

arr1 = [1, 2, 3];
arr1.push(4, 5, 6);
document.write(`<h3> 4. ${arr1} </h3>`);

/*
5. Дан масив [1, 2, 3]. Додайте йому на початок елементи 4, 5, 6.</li>
 */

arr1 = [1, 2, 3];
arr1.unshift(4, 5, 6);
document.write(`<h3> 5. ${arr1} </h3>`);

/*
6. Дан масив ['js', 'css', 'jq']. Виведіть перший елемент на екран.</li>
 */

arr1 = ["js", "css", "jq"];
document.write(`<h3> 6. ${arr1[0]} </h3>`);

/*
7. Дан масив [1, 2, 3, 4, 5]. За допомогою методу slice запишіть нові елементи [1, 2, 3].
 */

arr1 = [1, 2, 3, 4, 5];
arr2 = arr1.slice(0, 3);
document.write(`<h3> 7. ${arr2} </h3>`);

/*
8. Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 4, 5].
 */

arr1 = [1, 2, 3, 4, 5];
arr1.splice(1, 2);
document.write(`<h3> 8. ${arr1} </h3>`);

/*
9. Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 2, 10, 3, 4, 5].
 */

arr1 = [1, 2, 3, 4, 5];
arr1.splice(2, 0, 10);
document.write(`<h3> 9. ${arr1} </h3>`);

/*
10. Дан масив [3, 4, 1, 2, 7]. Відсортуйте його.
 */

arr1 = [3, 4, 1, 2, 7];
document.write(`<h3> 10. ${arr1.sort()} </h3>`);

/*
11. Дан масив з елементами 'Привіт, ', 'світ' і '!'. Потрібно вивести на екран фразу 'Привіт, мир!'.
*/

arr1 = ["Привіт, ", "світ", "!"];
arr1.splice(1, 1);
arr1.splice(1, 0, "мир");
document.write(`<h3> 11. ${arr1.join("")} </h3>`);

/*
12. Дан масив ['Привіт, ', 'світ', '!']. Необхідно записати в нульовий елемент цього масиву слово 'Поки, ' (тобто замість слова 'Привіт, ' буде 'Поки, ').
 */

arr1 = ["Привіт, ", "світ", "!"];
arr1.splice(0, 1);
arr1.splice(0, 0, "Поки, ");
document.write(`<h3> 12. ${arr1.join("")} </h3>`);

/*
13. Створіть масив arr з елементами 1, 2, 3, 4, 5 двома різними способами.
 */

let arr = [1, 2, 3, 4, 5];
arr = new Array(1, 2, 3, 4, 5);
document.write(`<h3> 13. ${arr} </h3>`);

/*
14. Дан багатовимірний масив arr:
        <br>
        <pre>
            <code>
                var arr = {
                    'ru':['блакитний', 'червоний', 'зелений'],
                    'en':['blue', 'red', 'green'],
                };
            </code>
        </pre>
        Виведіть за його допомогою слово 'блакитний' 'blue' .
 */

arr = [
  ["блакитний", "червоний", "зелений"],
  ["blue", "red", "green"],
];

document.write(`<h3> 14. ${arr[0][0]} ${arr[1][0]} </h3>`);

/*
15. Створіть масив arr = ['a', 'b', 'c', 'd'] і за допомогою його виведіть на екран рядок 'a+b, c+d'.
 */

arr = ["a", "b", "c", "d"];
document.write(`<h3> 15. ${arr[0]} + ${arr[1]}, ${arr[2]} + ${arr[3]}</h3>`);

/*
16. Запитайте у користувача кількість елементів масиву. Виходячи з даних, які ввів користувач
    створіть масив на ту кількість елементів, яку передав користувач.
    у кожному індексі масиву зберігайте чило який показуватиме номер елемента масиву.
 */

let num = new Array(parseInt(prompt("Ведiть кількість елементів масиву")));

for (let i = 0; i < num.length; i++) {
  num[i] = i + 1;
}
document.write(`<h3> 16. ${num}</h3>`);

/*
17. Зробіть так, щоб з масиву, який ви створили вище, вивелися всі непарні числа в параграфі, а парні в спані з червоним тлом.
 */
document.write(`<h3>17.</h3>`);

for (let i = 0; i < num.length; i++) {
  if (num[i] % 2 === 0) {
    document.write(`<span style="background-color:red;color:white"> ${num[i]} </span>`);
  } else {
    document.write(`<p> ${num[i]} </p>`);
  }
}

document.write("<br/>");

/*
18. Напишіть код, який перетворює та об'єднує всі елементи масиву в одне рядкове значення. Елементи масиву будуть розділені комою.
           <pre>
               <code>
                var vegetables = ['Капуста', 'Ріпа', 'Редиска', 'Морковка'];
    
                <span class="green">// Ваш код</span>

                
                document.write(str1); // "Капуста, Ріпа, Редиска, Морквина"
               </code>
           </pre>
 */

var vegetables = ["Капуста", "Ріпа", "Редиска", "Морковка"];
document.write(`<h3> 18. ${vegetables.join(", ")} </h3>`);
